<?php

// +----------------------------------------------------------------------
// | 配置业务状态码
// +----------------------------------------------------------------------

return [
    '0'     => '成功',
    '100'   => '非法请求',
    # 10000 通用错误
    '10000' => '未定义的错误信息',
    '10001' => '验证错误',
    '10002' => '重复提交，请重试或刷新页面',
    '10003' => '参数不正确',
    '10004' => '没有找到此记录',
    '10005' => '保存失败',
    '10006' => '修改失败',
    '10007' => '删除失败',
    '10008' => '数据查询失败',
    '10010' => '您没有该操作权限',
    # 11000 用户
    '11000' => '用户不存在',
    '11001' => '此账号已停用',
    '11002' => '密码错误，请重试',
    '11003' => '连续登录失败次数超过5次，5分钟内禁止登录',
    '11004' => '新密码和旧密码一致',
    '11005' => '超级管理员信息不可更改，请联系平台管理员',
    '11071' => '管理员角色不存在',
    '11088' => '没有找到控制器，请联系平台管理员',
    '11089' => '没有找到此方法，请联系平台管理员',
    '11090' => '没有找到此方法所对应的关联方法，请联系平台管理员',
    '11091' => '有子节点，删除失败',
    '11092' => '核心参数不能为空',
    '11093' => '父节点是模块，当前类型就必须是控制器',
    '11094' => '父节点是控制器，当前类型就必须是方法',
    '11095' => '父节点是根节点，当前类型就必须是模块',
    '11096' => '当前节点已经存在，请勿重复提交',
    '11097' => '设置的父节点可能会陷入死循环',
    '11098' => '设置的父菜单可能陷入死循环',
    '11099' => '如果是控制器节点，菜单节点必须和父节点保持一致',
    '11101' => '父节点可能会陷入死循环',
];
